# 1. შექმენი ფუნქცია, რომელიც მომხმარებლისგან მიღებულ ინფორმაციას გაასამმაგებს და დაბეჭდავს შემდეგნაირად: input: “ablabdabdab” Output: „Tripled: ablabdabdabablabdabdabablabdabdab“
########################################################################################################################################
# მომხმარებლისგან ინფორმაციის შემოტანა

def triple_input(input_str):
    tripled_str = input_str * 3
    print("Output: Tripled:", tripled_str)
 
user_input = input("Input: ")
triple_input(user_input)




########################################################################################################################################
#2. შექმენი ფუნქცია, რომელიც მიიღებს მომხმარებლის წონას და დააბრუნებს მის წონას მთვარეზე. (მთვარის გრავიტაცია 6_ჯერ ნაკლებია დედამიწისაზე
########################################################################################################################################

def print_weight_divided_by_six():
    try:
        # მომხმარებლის წონის შეტანა
        user_weight = float(input("შეიყვანეთ თქვენი წონა: "))

        # წონის გაყოფა 6-ზე და დაბეჭდვა
        result = user_weight / 6
        print(f"წონა გაყოფილი 6-ზე: {result}")
    except ValueError:
        print("შემოიტანეთ სწორი რიცხვი თქვენი წონისთვის.")

# ფუნქციის გამოძახება
print_weight_divided_by_six()




########################################################################################################################################
#3. შექმენი კალკულატორის ფუნქცია, რომელიც მიიღებს გამოსახულებას მომხმარებლისგან input() ფუნქციის დახმარებით (სამ მონაცემს _ პირველ რიცხვს, მოქმედებას (+ - * / ^), მეორე რიცხვს)
########################################################################################################################################

def calculator():
    try:
        # შეყვანა
        input_str = input("შეიყვანეთ გამოსახულება: ")

        # კალკულაცია
        result = eval(input_str)

        # შედეგის დაბეჭდვა
        print(f"შედეგი: {result}")
    except ZeroDivisionError:
        print("გაყოფა ნულზე არ შეიძლება.")
    except Exception as e:
        print(f"შეცდომა: {e}")

# კალკულატორის ფუნ
calculator()


